Text_2D_nointerven_compPar_sametutname/0.orig/include/frontBackUpperPatches.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

upperWall
{
    type slip;
}

front
{
    type slip;
}
Back
{
    type slip;
}

// ************************************************************************* //
